// =====================================================================================================================================================================
//
// アイテムの処理 [item.h]
// Author : Sato Yoshiki
//
// =====================================================================================================================================================================
#ifndef _ITEM_H_
#define _ITEM_H_

// =====================================================================================================================================================================
// インクルードファイル
// =====================================================================================================================================================================
#include "main.h"
#include "scene3D.h"

// =====================================================================================================================================================================
// マクロ定義
// =====================================================================================================================================================================
#define MAX_EFFECT (50)

// =====================================================================================================================================================================
// 前方宣言
// =====================================================================================================================================================================
class	CEffect;			// エフェクトクラス

// =====================================================================================================================================================================
// アイテムクラス
// =====================================================================================================================================================================
class CItem : public CScene3D
{
public:

	// アイテムの種類
	enum ITEMTYPE
	{
		ITEMTYPE_NONE = -1,
		ITEMTYPE_SPEED,					// スピードアップ
		ITEMTYPE_DIAMOND,				// スコアアイテム	 ( ダイヤ
		ITEMTYPE_JEWEL,					// スコアアイテム	 ( 宝石
		ITEMTYPE_GOLD,					// スコアアイテム	 ( 金貨
		ITEMTYPE_KEY,					// 鍵
		ITEMTYPE_1UP,					// 1UP
		ITEMTYPE_TREASURE,				// 財宝
		ITEMTYPE_ENERGY,				// エネルギー
		ITEMTYPE_MAX,
	};

	CItem();									// コンストラクタ
	~CItem();									// デストラクタ

	/* メンバ関数 */
	void						Init();					// 初期化
	void						Uninit();				// 終了
	void						Update();				// 更新
	void						Draw();					// 描画

	/* 静的メンバ関数 */
	static	CItem				*Create(D3DXVECTOR3 pos, ITEMTYPE type);	// アイテムの生成
	static	HRESULT				Load();										// ロード
	static	void				Unload();									// アンロード

	/* メンバ関数 */
	ITEMTYPE					GetItemType()	{ return m_ItemType; };		// アイテムの種類の取得
	void						SetItemType(ITEMTYPE type);					// アイテムの種類の設定

private:
	/* メンバ変数 */
	bool						CollisionPlayer();							// プレイヤーとの当たり判定
	/* 静的メンバ変数 */
	static	LPDIRECT3DTEXTURE9	m_apTexture[ITEMTYPE::ITEMTYPE_MAX];		// 共有テクスチャのポインタ
	static	CEffect				*m_pEffect[MAX_EFFECT];						// エフェクト情報
	static	int					m_nID;										// 番号

	/* メンバ変数 */
	D3DXVECTOR3					m_pos;										// 位置
	D3DXVECTOR3					m_size;										// サイズ
	D3DXCOLOR					m_col;										// 色
	ITEMTYPE					m_ItemType;									// 種類
	bool						m_bHit;										// ヒットフラグ
};
#endif
