// =====================================================================================================================================================================
//
// ロードの処理 [load.cpp]
// Author : Sato Yoshiki
//
// =====================================================================================================================================================================
#include "load.h"			// インクルードファイル
#include "keyboard.h"

// =====================================================================================================================================================================
// 静的メンバ変数の初期化
// =====================================================================================================================================================================
int			CLoad::m_anRankingData[RANKING_DATE]	= {};

// =====================================================================================================================================================================
// マクロ定義
// =====================================================================================================================================================================
#define RANKING_FILE_NAME			("data/FILE/RANKING/ranking.txt")		// セーブファイル

// =====================================================================================================================================================================
//
// ランキングの読み込み
//
// =====================================================================================================================================================================
void CLoad::RankingLoad()
{
	// ファイルポイント
	FILE *pFile;

	// ファイルを開く
	pFile = fopen(RANKING_FILE_NAME, "r");

	// ロード
	if (pFile != NULL)
	{
		for (int nCntRanking = 0; nCntRanking < RANKING_DATE; nCntRanking++)
		{
			fscanf(pFile, "%d", &m_anRankingData[nCntRanking]);
		}
		// ファイルクローズ
		fclose(pFile);
	}
	else
	{
		printf("開けん");
	}
}

// =====================================================================================================================================================================
//
// ランキングの書き込み
//
// =====================================================================================================================================================================
void CLoad::RankingSave(int nPoint)
{
	// ファイルポイント
	FILE	*pFile;
	int		anData[RANKING_DATE + 1] = {};	// ランキングの値
	int		nDate = 0;
	int		nCntRanking;
	int		nCntNum;

	// ロード
	RankingLoad();

	// 入れ替える前のランキングポイントを代入
	for (nCntRanking = 0; nCntRanking < RANKING_DATE; nCntRanking++)
	{
		anData[nCntRanking] = m_anRankingData[nCntRanking];
	}

	// 今回とったポイント数
	anData[5] = nPoint;

	// 左辺のランキングループ
	for (nCntRanking = 0; nCntRanking < RANKING_DATE + 1; nCntRanking++)
	{
		// 右辺のランキングループ
		for (nCntNum = nCntRanking + 1; nCntNum < RANKING_DATE + 1; nCntNum++)
		{
			// ランキングポイントを比較
			if (anData[nCntRanking] < anData[nCntNum])
			{
				nDate = anData[nCntNum];
				anData[nCntNum] = anData[nCntRanking];
				anData[nCntRanking] = nDate;
			}
		}
	}

	// 入れ替えた後のランキングポイントを代入
	for (nCntRanking = 0; nCntRanking < RANKING_DATE; nCntRanking++)
	{
		m_anRankingData[nCntRanking] = anData[nCntRanking];
	}

	// ファイル開
	pFile = fopen(RANKING_FILE_NAME, "w");

	// セーブ
	if (pFile != NULL)
	{
		for (nCntRanking = 0; nCntRanking < RANKING_DATE; nCntRanking++)
		{
			fprintf(pFile, "%d\n", anData[nCntRanking]);
		}
		// ファイル閉
		fclose(pFile);
	}
	else
	{
		printf("開けん");
	}
}

// =====================================================================================================================================================================
//
// ランキングの値の取得
//
// =====================================================================================================================================================================
int *CLoad::GetRankingData()
{
	return &m_anRankingData[0];
}