// =====================================================================================================================================================================
//
// メインの処理 [main.h]
// Author : Sato Yoshiki
//
// =====================================================================================================================================================================
#ifndef _MAIN_H_
#define _MAIN_H_

#define DIRECTINPUT_VERSION (0x0800)	// 警告対処用
#define _CRT_SECURE_NO_WARNINGS
#include <windows.h>					// インクルードファイル
#include "d3dx9.h"						// 描画処理に必要
#include "xaudio2.h"
#include "dinput.h"
#include <string.h>						// 文字列ヘッダー
#include <stdio.h>						// 入出力に関する関数
#include <stdarg.h>						// 可変長引数を実装する関数
#include "library.h"					// 汎用ライラブリ
#include "XInput.h"						// Xinput

#include "imgui.h"
#include "imgui_impl_dx9.h"
#include "imgui_impl_win32.h"
#include <d3d9.h>
#include <tchar.h>

#define _CRTDBG_MAP_ALLOC
#include <stdlib.h>
#include <crtdbg.h>

// =====================================================================================================================================================================
// ライラブリのリンク
// =====================================================================================================================================================================
#pragma comment(lib, "d3d9.lib")	// 描画処理に必要
#pragma comment(lib, "d3dx9.lib")	// [d3d9.lib]の拡張コンテンツ
#pragma comment(lib, "dxguid.lib")	// DirectXコンポーネント(部品)仕様に必要
#pragma comment(lib, "winmm.lib")	// システム時間取得に必要
#pragma comment(lib, "dinput8.lib")	// 入力処理に必要
#pragma comment(lib, "xinput.lib")	// Xinputに必要

// =====================================================================================================================================================================
// マクロ定義
// =====================================================================================================================================================================
#define SCREEN_WIDTH	(1280)					// ウィンドウの幅				
#define SCREEN_HEIGHT	(720)					// ウィンドウの高さ				

#define NUM_POLYGON		(2)						// ポリゴン枚数

// 2Dポリゴン頂点フォーマット( 頂点座標[2D] / 頂点カラー / テクスチャ座標 )
#define FVF_VERTEX_2D	(D3DFVF_XYZRHW | D3DFVF_DIFFUSE | D3DFVF_TEX1)

// 3Dポリゴン頂点フォーマット
#define FVF_VERTEX_3D	(D3DFVF_XYZ | D3DFVF_NORMAL | D3DFVF_DIFFUSE | D3DFVF_TEX1)

// =====================================================================================================================================================================
// 前方宣言	( ポインタだけなら使える )
// =====================================================================================================================================================================
class	CRenderer;			// レンダラークラス
class	CScene;				// シーンクラス

// =====================================================================================================================================================================
// プロトタイプ宣言
// =====================================================================================================================================================================
int		GetFPSCount();		// FPSのカウント取得

extern	LRESULT ImGui_ImplWin32_WndProcHandler(HWND hWnd, UINT msg, WPARAM wParam, LPARAM lParam);	// Win32 message handler


#endif