// =====================================================================================================================================================================
//
// マップの処理 [map.h]
// Author : Sato Yoshiki
//
// =====================================================================================================================================================================
#ifndef _MAP_H_
#define _MAP_H_

// =====================================================================================================================================================================
// マクロ定義
// =====================================================================================================================================================================
#define MAX_OBJECT				(100)										// オブジェクトの最大数
#define MAX_OBJECT2D			(30)										// 2Dオブジェクトの最大数
#define MAX_ITEM				(50)										// アイテムの最大数
#define MAX_SLOPE				(20)										// 坂の最大数

// =====================================================================================================================================================================
// インクルードファイル
// =====================================================================================================================================================================
#include "main.h"

// =====================================================================================================================================================================
// 前方宣言
// =====================================================================================================================================================================
class	CObjectModel;			// オブジェクトモデルクラス
class	CEffect;				// エフェクトクラス
class	CItem;					// アイテムクラス
class	CObject2D;				// 2Dオブジェクトクラス
class	CSlope;					// 坂クラス

// =====================================================================================================================================================================
// マップクラス
// =====================================================================================================================================================================
class CMap
{
public:
	/* 静的メンバ関数 */
	static	bool	CollisionObjectAll(D3DXVECTOR3 *pPos, D3DXVECTOR3 *pPosOld, D3DXVECTOR3 *pMove, D3DXVECTOR3 *pSize);	// オブジェクトの当たり判定
	static	bool	CollisionObject2DAll(D3DXVECTOR3 *pPos, D3DXVECTOR3 *pPosOld, D3DXVECTOR3 *pMove, D3DXVECTOR3 *pSize);	// 2Dオブジェクトの当たり判定
	static	bool	GetHeightSlopeAll(D3DXVECTOR3 &pos, D3DXVECTOR3 &move);		// 坂の高さの取得
	static	void	MapUpdate();							// マップの更新
	static	void	ObjectLoad();							// マップの読み込み
	static	void	Object2DLoad();							// 2Dオブジェクトの読み込み
	static	void	ItemLoad();								// アイテムの読み込み
	static	void	SlopeLoad();							// 坂の読み込み
	static	void	ReleaseMap();							// マップの開放

	static	void	SetProvisionalMap();					// 試験的マップの配置

private:
	/* 静的メンバ関数 */
	static	void	ObjectSave();							// マップの書き込み
	static	void	Object2DSave();							// 2Dオブジェクトの書き込み
	static	void	ItemSave();								// アイテムの書き込み
	static	void	SlopeSave();							// 坂の書き込み
	static	void	ObjectSet();							// オブジェクトのセット
	static	void	Object2DSet();							// 2Dオブジェクトのセット
	static	void	ItemSet();								// アイテムのセット
	static	void	SlopeSet();								// 坂のセット

	/* 静的メンバ変数 */
	static CObjectModel		*m_pObject[MAX_OBJECT];			// オブジェクト情報
	static CObject2D		*m_pObject2D[MAX_OBJECT2D];		// 2Dオブジェクト情報
	static CItem			*m_pItem[MAX_ITEM];				// アイテム情報
	static CSlope			*m_pSlope[MAX_SLOPE];			// 坂の情報
};
#endif
