// =====================================================================================================================================================================
//
// マルチナンバーの処理 [multinumber.h]
// Author : Sato Yoshiki
//
// =====================================================================================================================================================================
#ifndef _MULTINUMBER_H_
#define _MULTINUMBER_H_

#include "main.h"

#define NUM_DIGIT (8)			// 桁数

// =====================================================================================================================================================================
// 前方宣言	( ポインタだけなら使える )
// =====================================================================================================================================================================
class CNumber;					// ナンバークラス

// =====================================================================================================================================================================
// マルチナンバークラス
// =====================================================================================================================================================================
class CMultiNumber
{
public:

	CMultiNumber();											// コンストラクタ
	~CMultiNumber();										// デストラクタ

	/* メンバ関数 */
	void				Init();								// 初期化
	void				Uninit();							// 終了
	void				Update();							// 更新
	void				Draw();								// 描画

	/* 静的メンバ関数 */
	static  CMultiNumber*Create(D3DXVECTOR3 pos, D3DXVECTOR3 size, int nValue, float fSpace);		// マルチナンバーの生成
	static	void		SetScore(int nScore);				// スコアの設定

private:
	/* 静的メンバ変数 */
	static CNumber				*m_apNumber[NUM_DIGIT];		// ナンバーのポインタ
	static D3DXVECTOR2			m_UVsize;					// UVサイズ
	static int					m_nMultiNumber;				// マルチナンバー
};
#endif
