// =====================================================================================================================================================================
//
// ナンバーの処理 [number.h]
// Author : Sato Yoshiki
//
// =====================================================================================================================================================================
#ifndef _NUMBER_H_
#define _NUMBER_H_

#include "main.h"
#include "scene2D.h"

// =====================================================================================================================================================================
// ナンバークラス
// =====================================================================================================================================================================
class CNumber : public CScene2D
{
public:
	CNumber();						// コンストラクタ
	~CNumber();						// デストラクタ

	/* メンバ関数 */
	void	Init();					// 初期化
	void	Uninit();				// 終了
	void	Update();				// 更新
	void	Draw();					// 描画

	/* 静的メンバ関数 */
	static  CNumber *Create();		// ナンバーの生成
	static	HRESULT	Load();			// ロード
	static	void	Unload();		// アンロード
		
private:
	/* 静的メンバ変数 */
	static	LPDIRECT3DTEXTURE9	m_pTexture;		// 共有テクスチャのポインタ
};
#endif
