// =====================================================================================================================================================================
//
// ポーズUIの処理 [pauseUI.cpp]
// Author : Sato Yoshiki
//
// =====================================================================================================================================================================
#include "pauseUI.h"			// インクルードファイル
#include "renderer.h"
#include "pause.h"

// =====================================================================================================================================================================
// 静的メンバ変数の初期化
// =====================================================================================================================================================================
LPDIRECT3DTEXTURE9	CPauseUI::m_apTexture[PAUSEUITYPE::P_UI_MAX]	= {};				// 先頭は型名
int					CPauseUI::m_nNum								= 0;

// =====================================================================================================================================================================
// マクロ定義
// =====================================================================================================================================================================
#define TEXTURE_FILE00		"data/TEXTURE/resume.png"	// 読み込むテクスチャファイル名		( 再開 )
#define TEXTURE_FILE01		"data/TEXTURE/restart.png"	// 読み込むテクスチャファイル名		( リスタート )
#define TEXTURE_FILE02		"data/TEXTURE/exit.png"		// 読み込むテクスチャファイル名		( タイトル )
#define TEXTURE_FILE03		"data/TEXTURE/pause.png"	// 読み込むテクスチャファイル名		( ポーズロゴ )

#define BG_SIZEX			(SCREEN_WIDTH / 2)			// 座標の幅							( 背景 )
#define BG_SIZEY			(SCREEN_HEIGHT / 2)			// 座標の高さ						( 背景 )

#define LOGO_SIZEX			(600 / 2)					// 座標の幅							( ポーズロゴ )
#define LOGO_SIZEY			(170 / 2)					// 座標の高さ						( ポーズロゴ )

#define MENU_SIZEX			(250 / 2)					// 座標の幅							( ボタン )
#define MENU_SIZEY			(80 / 2)					// 座標の高さ						( ボタン )

#define BG_SPEED			(5)							// 背景の速さ

// =====================================================================================================================================================================
//
// コンストラクタ
//
// =====================================================================================================================================================================
CPauseUI::CPauseUI()
{
}

// =====================================================================================================================================================================
//
// デストラクタ
//
// =====================================================================================================================================================================
CPauseUI::~CPauseUI()
{
}

// =====================================================================================================================================================================
//
// 初期化処理
//
// =====================================================================================================================================================================
void CPauseUI::Init()
{
	// 変数の初期化
	m_bFlash = true;										// 点滅切り替え
	m_nNum = 0;												// ナンバー
	m_nTime = 0;											// タイム

	for (int nCnt = 0; nCnt < PAUSEUITYPE::P_UI_MAX; nCnt++)
	{
		// 色の初期化
		m_aCol[nCnt]	= D3DXCOLOR(1.0f, 1.0f, 1.0f, 0.0f);		// 色

		if(m_apScene2D != NULL)
		{ 
			// シーン2Dの生成
			m_apScene2D[nCnt] = CScene2D::Create();

			// テクスチャの割り当て
			m_apScene2D[nCnt]->BindTexture(m_apTexture[nCnt]);

			// 初期化
			m_apScene2D[nCnt]->Init();
			
			switch (nCnt)
			{
			case PAUSEUITYPE::P_UI_RESUME:

				//位置の設定
				m_apScene2D[nCnt]->SetPos(D3DXVECTOR3(BG_SIZEX, 300.0f, 0.0f));
				// サイズの設定
				m_apScene2D[nCnt]->SetSize(D3DXVECTOR3(MENU_SIZEX, MENU_SIZEY, 0.0f));
				// 色の設定
				m_apScene2D[nCnt]->SetCol(D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f));
				break;

			case PAUSEUITYPE::P_UI_RESTART:

				//位置の設定
				m_apScene2D[nCnt]->SetPos(D3DXVECTOR3(BG_SIZEX, 400.0f, 0.0f));
				// サイズの設定
				m_apScene2D[nCnt]->SetSize(D3DXVECTOR3(MENU_SIZEX, MENU_SIZEY, 0.0f));
				// 色の設定
				m_apScene2D[nCnt]->SetCol(D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f));
				break;

			case PAUSEUITYPE::P_UI_TITLE:

				//位置の設定
				m_apScene2D[nCnt]->SetPos(D3DXVECTOR3(BG_SIZEX, 500.0f, 0.0f));
				// サイズの設定
				m_apScene2D[nCnt]->SetSize(D3DXVECTOR3(MENU_SIZEX, MENU_SIZEY, 0.0f));
				// 色の設定
				m_apScene2D[nCnt]->SetCol(D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f));
				break;

			case PAUSEUITYPE::P_UI_LOGO:

				//位置の設定
				m_apScene2D[nCnt]->SetPos(D3DXVECTOR3(BG_SIZEX, 200.0f, 0.0f));
				// サイズの設定
				m_apScene2D[nCnt]->SetSize(D3DXVECTOR3(LOGO_SIZEX, LOGO_SIZEY, 0.0f));
				// 色の設定
				m_apScene2D[nCnt]->SetCol(D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f));
				break;
			}
		}
	}
	//// タイプの設定
	//CScene::SetType(OBJTYPE_BG);
}

// =====================================================================================================================================================================
//
// 終了処理
//
// =====================================================================================================================================================================
void CPauseUI::Uninit(void)
{
	for (int nCnt = 0; nCnt < PAUSEUITYPE::P_UI_MAX; nCnt++)
	{
		if (m_apScene2D != NULL)
		{
			m_apScene2D[nCnt]->Uninit();
		}
	}
}

// =====================================================================================================================================================================
//
// 更新処理
//
// =====================================================================================================================================================================
void CPauseUI::Update(void)
{
	// 時間加算
	m_nTime++;

	for (int nCnt = 0; nCnt < PAUSEUITYPE::P_UI_MAX; nCnt++)
	{
		// UIの内容設定
		UIConfig(nCnt);

		// 更新
		m_apScene2D[nCnt]->Update();
	}
}

// =====================================================================================================================================================================
//
// 描画処理
//
// =====================================================================================================================================================================
void CPauseUI::Draw(void)
{	
	for (int nCnt = 0; nCnt < PAUSEUITYPE::P_UI_MAX; nCnt++)
	{
		if (m_apScene2D != NULL)
		{
			m_apScene2D[nCnt]->Draw();
		}
	}
}

// =====================================================================================================================================================================
//
// ポーズUIの生成
//
// =====================================================================================================================================================================
CPauseUI * CPauseUI::Create()
{
	// 変数
	CPauseUI *pTitleUI;

	// メモリの確保
	pTitleUI = new CPauseUI();

	// 初期化
	pTitleUI->Init();

	return pTitleUI;
}

// =====================================================================================================================================================================
//
// ロード
//
// =====================================================================================================================================================================
HRESULT CPauseUI::Load(void)
{
	// デバイスの取得
	LPDIRECT3DDEVICE9 pDevice = *CManager::GetRenderer()->GetDevice();

	// テクスチャファイル名
	char *sTextureFileName[P_UI_MAX]
	{
		{ TEXTURE_FILE00 },		// P_UI_LOGO			( ロゴ
		{ TEXTURE_FILE01 },		// P_UI_GAMESTART		( ゲームスタート
	};

	for (int nCntUI = 0; nCntUI < P_UI_MAX; nCntUI++)
	{
		// テクスチャ読み込み
		D3DXCreateTextureFromFile(pDevice, sTextureFileName[nCntUI], &m_apTexture[nCntUI]);
	}

	for (int nCnt = 0; nCnt < PAUSEUITYPE::P_UI_MAX; nCnt++)
	{
		// エラーチェック
		if (m_apTexture[nCnt] == NULL)
		{
			return E_FAIL;
		}
	}

	return S_OK;
}

// =====================================================================================================================================================================
//
// アンロード
//
// =====================================================================================================================================================================
void CPauseUI::Unload(void)
{
	for (int nCnt = 0; nCnt < PAUSEUITYPE::P_UI_MAX; nCnt++)
	{
		// テクスチャの開放
		if (m_apTexture != NULL)
		{
			m_apTexture[nCnt]->Release();
			m_apTexture[nCnt] = NULL;
		}
	}
}

// =====================================================================================================================================================================
//
// UIの内容設定
//
// =====================================================================================================================================================================
void CPauseUI::UIConfig(int nCnt)
{
	switch (nCnt)
	{
	case PAUSEUITYPE::P_UI_RESUME:
		break;

	case PAUSEUITYPE::P_UI_RESTART:
		break;

	case PAUSEUITYPE::P_UI_TITLE:
		break;

	case PAUSEUITYPE::P_UI_LOGO:
		break;
	}
}