// =====================================================================================================================================================================
//
// ウォールの処理 [wall.h]
// Author : Sato Yoshiki
//
// =====================================================================================================================================================================
#ifndef _WALL_H_
#define _WALL_H_

// =====================================================================================================================================================================
// インクルードファイル
// =====================================================================================================================================================================
#include "main.h"
#include "scene3D.h"

// =====================================================================================================================================================================
// ウォールクラス
// =====================================================================================================================================================================
class CWall : public CScene3D
{
public:

	// ウォールの種類
	enum WALLTYPE
	{
		WALL_NONE = -1,
		WALL_CENTER,					// 真ん中
		WALL_LEFT,						// 左
		WALL_RIGHT,						// 右
		WALL_MAX,
	};

	CWall();									// コンストラクタ
	~CWall();									// デストラクタ

	/* メンバ関数 */
	void				Init();					// 初期化
	void				Uninit();				// 終了
	void				Update();				// 更新
	void				Draw();					// 描画

	/* 静的メンバ関数 */
	static	CWall		*Create(WALLTYPE type);	// ウォールの生成
	static	HRESULT		Load();					// ロード
	static	void		Unload();				// アンロード

private:
	/* メンバ関数 */
	/* 静的メンバ変数 */
	static	LPDIRECT3DTEXTURE9	m_apTexture[WALLTYPE::WALL_MAX];		// 共有テクスチャのポインタ
	/* メンバ変数 */
	D3DXVECTOR3					m_pos;									// 位置
	D3DXCOLOR					m_col;									// 色
	WALLTYPE					m_type;									// 種類
	float						m_fAngle;								// 角度
	float						m_fLength;								// 長さ
};
#endif