// =====================================================================================================================================================================
//
// リザルトUIの処理 [resultUI.h]
// Author : fujiwara masato
//
// =====================================================================================================================================================================
#ifndef _RESULTUI_H_
#define _RESULTUI_H_

// =====================================================================================================================================================================
// インクルードファイル
// =====================================================================================================================================================================
#include "main.h"
#include "UI.h"

// =====================================================================================================================================================================
// 前方宣言
// =====================================================================================================================================================================
class CScene2D;
class CMultiNumber;

// =====================================================================================================================================================================
// リザルトUIクラス
// =====================================================================================================================================================================
class CResultUI : CUI
{
public:
	// リザルトUIの種類
	enum RESULT_UI
	{
		RESULT_UI_BG,				// 背景
		RESULT_UI_NAME,				// リザルトの名前
		RESULT_UI_1P,				// 1プレイヤー
		RESULT_UI_2P,				// 2プレイヤー
		RESULT_UI_EVALUATION01P,	// 評価0
		RESULT_UI_EVALUATION11P,	// 評価1
		RESULT_UI_EVALUATION21P,	// 評価2
		RESULT_UI_EVALUATION02P,	// 評価0
		RESULT_UI_EVALUATION12P,	// 評価1
		RESULT_UI_EVALUATION22P,	// 評価2
		RESULT_UI_MISSIONCOMP1,		// ミッションクリア1
		RESULT_UI_MISSIONCOMP2,		// ミッションクリア2
		RESULT_UI_MAX
	};

	CResultUI();							// コンストラクタ
	~CResultUI();							// デストラクタ

	/* メンバ関数 */
	HRESULT					Init(void);		// 初期化
	void					Uninit(void);	// 終了
	void					Update(void);	// 更新
	void					Draw(void);		// 描画

	/* 静的メンバ関数 */
	static  CResultUI		*Create();		// リザルトUIの生成

	/* メンバ関数 */

private:
	/* メンバ関数 */
	void					DrawConditions();								// 描画条件
	void					ResultUICreate();								// リザルトUIをまとめて生成する

	/* 静的メンバ変数 */
	static LPDIRECT3DTEXTURE9	m_TexNum[RESULT_UI_MAX];					// バインドするテクスチャの情報
	static D3DXVECTOR3			m_Pos[RESULT_UI_MAX];						// 座標情報
	static D3DXVECTOR3			m_Size[RESULT_UI_MAX];						// サイズ情報

	/* メンバ変数 */
	CScene2D				*m_apScene2D[RESULT_UI_MAX];					// シーン2Dのポインタ
	CMultiNumber			*m_pBonusScore;									// ボーナススコア
	CMultiNumber			*m_pPrisonerNum;								// プレイヤーの残機の数
};
#endif