// =====================================================================================================================================================================
//
// スコアマネージャーの処理 [scoremanager.cpp]
// Author : fujiwara masato
//
// =====================================================================================================================================================================
#include "main.h"
#include "scoremanager.h"
#include "manager.h"

// =====================================================================================================================================================================
// 静的メンバ変数の初期化
// =====================================================================================================================================================================
int CScoreManager::m_nScore[SCORE_TYPE_MAX]		= {};
SCORE_DATA	CScoreManager::m_ScoreData			= {};

// =====================================================================================================================================================================
// テキストファイル名
// =====================================================================================================================================================================
char *CScoreManager::m_ScoreFileName =
{
	"data/Load/Score/ScoreData.txt" 			// スコアの情報
};

// =====================================================================================================================================================================
// マクロ定義
// =====================================================================================================================================================================

// =====================================================================================================================================================================
//
// コンストラクタ
//
// =====================================================================================================================================================================
CScoreManager::CScoreManager()
{
}

// =====================================================================================================================================================================
//
// デストラクタ
//
// =====================================================================================================================================================================
CScoreManager::~CScoreManager()
{
}

// =====================================================================================================================================================================
//
// 初期化処理
//
// =====================================================================================================================================================================
HRESULT CScoreManager::Init(void)
{
	return S_OK;
}

// =====================================================================================================================================================================
//
// 終了処理
//
// =====================================================================================================================================================================
void CScoreManager::Uninit(void)
{
}

// =====================================================================================================================================================================
//
// 更新処理
//
// =====================================================================================================================================================================
void CScoreManager::Update(void)
{
}

// =====================================================================================================================================================================
//
// アイテムの情報の設定
//
// =====================================================================================================================================================================
void CScoreManager::SetScoreData()
{
	m_nScore [SCORE_ITEM_BEAR]			 = m_ScoreData.nBear;
	m_nScore [SCORE_ITEM_COIN]			 = m_ScoreData.nCoin;
	m_nScore [SCORE_ITEM_JEWELRY]		 = m_ScoreData.nJewelry;
	m_nScore [SCORE_ITEM_MEDAL]			 = m_ScoreData.nMedal;
	m_nScore [SCORE_DAMAGE_BULLET]		 = m_ScoreData.nBullet;
	m_nScore [SCORE_DAMAGE_ATTACK]		 = m_ScoreData.nAttack;
	m_nScore [SCORE_RESCUE_PRISONER]	 = m_ScoreData.nPrisoner;
	m_nScore [SCORE_BONUS]				 = m_ScoreData.nBonus;
	m_nScore [SCORE_KILLED_BOSS]		 = m_ScoreData.nBoss;
}

// =====================================================================================================================================================================
//
// スコアのデータの読み込み
//
// =====================================================================================================================================================================
void CScoreManager::ScoreLoad()
{
	// ファイルポイント
	FILE *pFile;

	char cReadText[128];			// 文字として読み取る
	char cHeadText[128];			// 比較用
	char cDie[128];					// 不要な文字

									// ファイルを開く
	pFile = fopen(m_ScoreFileName, "r");

	// 開いているとき
	if (pFile != NULL)
	{
		// SCRIPTが来るまでループ
		while (strcmp(cHeadText, "SCRIPT") != 0)
		{
			fgets(cReadText, sizeof(cReadText), pFile); // 一文読み込み
			sscanf(cReadText, "%s", &cHeadText);		// 比較用テキストに文字を代入
		}

		// SCRIPTが来たら
		if (strcmp(cHeadText, "SCRIPT") == 0)
		{
			// END_SCRIPTが来るまでループ
			while (strcmp(cHeadText, "END_SCRIPT") != 0)
			{
				fgets(cReadText, sizeof(cReadText), pFile); // 一文読み込み
				sscanf(cReadText, "%s", &cHeadText);		// 比較用テキストに文字を代入

															// ITEMSETが来たら
				if (strcmp(cHeadText, "SCORESET") == 0)
				{
					// END_ITEMSETが来るまでループ
					while (strcmp(cHeadText, "END_SCORESET") != 0)
					{
						fgets(cReadText, sizeof(cReadText), pFile); // 一文読み込み
						sscanf(cReadText, "%s", &cHeadText);		// 比較用テキストに文字を代入

																	// SPEEDが来たら
						if (strcmp(cHeadText, "BEAR") == 0)
						{
							sscanf(cReadText, "%s %s %d", &cDie, &cDie, &m_ScoreData.nBear);	// 比較用テキストにBEARを代入
						}
						// LIFEが来たら
						else if (strcmp(cHeadText, "COIN") == 0)
						{
							sscanf(cReadText, "%s %s %d", &cDie, &cDie, &m_ScoreData.nCoin);	// 比較用テキストにCOINを代入
						}
						// FLASHが来たら
						else if (strcmp(cHeadText, "JEWELRY") == 0)
						{
							sscanf(cReadText, "%s %s %d", &cDie, &cDie, &m_ScoreData.nJewelry);	// 比較用テキストにJEWELRYを代入
						}
						// BEARが来たら
						else if (strcmp(cHeadText, "MEDAL") == 0)
						{
							sscanf(cReadText, "%s %s %d", &cDie, &cDie, &m_ScoreData.nMedal);	// 比較用テキストにMEDALを代入
						}
						// BEARが来たら
						else if (strcmp(cHeadText, "BULLET") == 0)
						{
							sscanf(cReadText, "%s %s %d", &cDie, &cDie, &m_ScoreData.nBullet);	// 比較用テキストにBULLETを代入
						}
						// BEARが来たら
						else if (strcmp(cHeadText, "ATTACK") == 0)
						{
							sscanf(cReadText, "%s %s %d", &cDie, &cDie, &m_ScoreData.nAttack);	// 比較用テキストにATTACKを代入
						}
						// BEARが来たら
						else if (strcmp(cHeadText, "PRISONER") == 0)
						{
							sscanf(cReadText, "%s %s %d", &cDie, &cDie, &m_ScoreData.nPrisoner);// 比較用テキストにPRISONERを代入
						}
						// BEARが来たら
						else if (strcmp(cHeadText, "BONUS") == 0)
						{
							sscanf(cReadText, "%s %s %d", &cDie, &cDie, &m_ScoreData.nBonus);	// 比較用テキストにBONUSを代入
						}
						// BEARが来たら
						else if (strcmp(cHeadText, "BOSS") == 0)
						{
							sscanf(cReadText, "%s %s %d", &cDie, &cDie, &m_ScoreData.nBoss);	// 比較用テキストにBOSSを代入
						}
						else if (strcmp(cHeadText, "END_SCORESET") == 0)
						{
						}
					}
				}
			}
		}
		// ファイルを閉じる
		fclose(pFile);
	}
	else
	{
		MessageBox(NULL, "スコアのデータ読み込み失敗", "警告", MB_ICONWARNING);
	}

	// 読み込んだ情報の代入
	SetScoreData();
}
