// =====================================================================================================================================================================
//
// 敵のヘリコプターのAIの処理 [EnemyHelicopterAI.h]
// Author : Sato Yoshiki
//
// =====================================================================================================================================================================
#ifndef _ENEMYHELICOPTERAI_H_
#define _ENEMYHELICOPTERAI_H_

// =====================================================================================================================================================================
// インクルードファイル
// =====================================================================================================================================================================
#include "main.h"
#include "scene.h"
#include "BaseAI.h"

// =====================================================================================================================================================================
// 前方宣言
// =====================================================================================================================================================================
class CWeakEnemy;
class CGun;
class CCollision;

// =====================================================================================================================================================================
// AIクラス
// =====================================================================================================================================================================
class CEnemyHelicopterAI : public CBaseAI
{
public:
	// 敵のヘリコプターのAIの状態
	enum class EnemyHelicopterAI_STATE
	{
		NONE = 0,			//何もしない
		STOP,				//止まる
		MOVE,				//移動
		ATTACK,				//攻撃
		AI_MAX				//行動の最大数
	};

	CEnemyHelicopterAI();									// コンストラクタ
	~CEnemyHelicopterAI();									// デストラクタ

	/* メンバ関数 */
	HRESULT					Init(void);						// 初期化
	void					Uninit(void);					// 終了
	void					Update(void);					// 更新
	void					Draw(void);						// 描画
	void					DebugInfo(void);				// デバッグ情報表記

	/* 静的メンバ関数 */
	static CEnemyHelicopterAI	*CreateAI(CWeakEnemy *pEnemy);	// AIの生成

	/* メンバ関数 */
	EnemyHelicopterAI_STATE		GetAIType(void);				// AIの状態取得

private:
	/* メンバ関数 */
	void						EnemyHelicopterAIState();		// 敵のヘリコプターのAIの状態
	void						FaceToPlayer();					// プレイヤーのほうに向く
	/* メンバ変数 */
	CWeakEnemy					*m_pEnemyPass;					// 敵の情報の格納用
	EnemyHelicopterAI_STATE		m_StateAI;						// 行動の種類
	int							m_nCntShotFrame;				// 撃つまでのカウント
	int							m_nCntMoveStopFrame;			// 止まるまでのカウント
	int							m_nCntMoveFrame;				// 移動するまでのカウント
	D3DXVECTOR3					m_vec;							// 向き

};
#endif