#pragma once
//=============================================================================
// ライト処理 [light.h]
//=============================================================================
#ifndef _LIGHT_H_
#define _LIGHT_H_

#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"
class CLight
{
public:
//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitLight(void);
void UninitLight(void);
void UpdateLight(void);
private:
D3DLIGHT9 m_light[3];
D3DMATERIAL9 m_lightmat;
D3DXVECTOR3 vecDir;

};
#endif
