// =====================================================================================================================================================================
//
// アイテム処理の説明[normal_item.h]
// Author : Fujiwara Masato
//
// =====================================================================================================================================================================
#ifndef _NORMAL_ITEM_H_
#define _NORMAL_ITEM_H_	 // ファイル名を基準を決める

// =====================================================================================================================================================================
// インクルードファイル
// =====================================================================================================================================================================
#include "scene3d.h"
#include "item.h"

// =====================================================================================================================================================================
// 前方宣言
// =====================================================================================================================================================================

// =====================================================================================================================================================================
// アイテムクラス
// =====================================================================================================================================================================
class CNormalItem : public CScene3D, public CItem
{
public:
	/* 関数 */
	CNormalItem(OBJ_TYPE type);																		// コンストラクタ
	~CNormalItem();																					// デストラクタ

	/* メンバ関数 */
	virtual HRESULT						Init();														// 初期化
	virtual void						Uninit();													// 終了
	virtual void						Update();													// 更新
	virtual void						Draw();														// 描画
	virtual void						DebugInfo();												// デバッグ
	virtual	void						SwitchTexture(ITEMTYPE type);								// 種類別テクスチャ設定
	virtual	void						ItemCollision();											// アイテムの当たり判定
	virtual void						ReflectionItem();											// 反射処理
	virtual	void						Flashing();													// 点滅処理
	virtual void						RemainTimer();												// 滞在時間を計算し0になったら削除する
	virtual void						HitItem(ITEMTYPE type, TAG Tag);							// アイテム取得時の種類別処理
	virtual void						ItemAcquisition(ITEMTYPE type, TAG Tag);					// アイテム取得時の種類別処理

	/* 静的メンバ関数 */
	static	CNormalItem					*DropItem(D3DXVECTOR3 droppos, bool fixed, ITEMTYPE type);	// キャラクターがアイテムを落とす時の生成
	static	void						DropItem_Multiple(											// アイテムを複数一気にドロップさせる時
		const D3DXVECTOR3 originpos,
		ITEM_LIST_DROPMULTIPLE type,
		ITEM_BEHAVIOR behavior);
};
#endif