// =====================================================================================================================================================================
//
// スコアマネージャーの処理 [scoremanager.h]
// Author : fujiwara masato
//
// =====================================================================================================================================================================
#ifndef _SCOREMANAGER_H_
#define _SCOREMANAGER_H_

// =====================================================================================================================================================================
// インクルードファイル
// =====================================================================================================================================================================
#include "main.h"

// =====================================================================================================================================================================
// マクロ定義
// =====================================================================================================================================================================
#define SCORE_LIMIT (9999999) // スコアの最大値
// =====================================================================================================================================================================
// アイテムのデータ
// =====================================================================================================================================================================
struct SCORE_DATA
{
	int					nFruit;			// 果物系のアイテム
	int					nFood;			// 食べ物のアイテム
	int					nGoldCoin;		// 金貨のアイテム
	int					nSilverCoin;	// 銀貨のアイテム
	int					nBronzeCoin;	// 銅貨のアイテム
	int					nBear;			// 熊のアイテム
	int					nLetter;		// 手紙のアイテム
	int					nDiamond;		// ダイアモンドのアイテム

	int					nAni_Bear;		// ぬいぐるみのアイテム
	int					nAni_Coin;		// コインのアイテム
	int					nAni_Food;		// 食べ物のアイテム
	int					nAni_Letter;	// 手紙のアイテム
	int					nAni_Jewelry;	// 宝石のアイテム
	int					nAni_Medal;		// メダルのアイテム
	int					nAni_Monkey;	// サルのアイテム

	int					nBullet;		// 敵に弾を当てた時
	int					nAttack;		// 敵に近接攻撃を当てたとき
	int					nPrisoner;		// 捕虜を助けた時
	int					nBonus;			// リザルトでのボーナス 自分の残機
	int					nBoss;			// リザルトでのボーナス ボスを倒した時

};

// =====================================================================================================================================================================
// 前方宣言
// =====================================================================================================================================================================
// =====================================================================================================================================================================
// リザルトUIクラス
// =====================================================================================================================================================================
class CScoreManager
{
public:
	enum SCORE_TYPE
	{
		SCORE_ITEM_FRUIT,		// 1000		// 熊のアイテム
		SCORE_ITEM_FOOD,		// 100		// コインのアイテム
		SCORE_ITEM_GCOIN,		// 10000	// 金貨
		SCORE_ITEM_SCOIN,		// 1000		// 銀貨
		SCORE_ITEM_BCOIN,		// 100		// 銅貨
		SCORE_ITEM_BEAR,		// 1500		// 熊
		SCORE_ITEM_LETTER,		// 500		// 手紙
		SCORE_ITEM_DIAMOND,		// 100000	// ダイヤモンド

		SCORE_ITEM_ANI_BEAR,	// 3000		// ぬいぐるみのアイテム
		SCORE_ITEM_ANI_COIN,	// 1000		// コインのアイテム
		SCORE_ITEM_ANI_FOOD,	// 500		// 食べ物のアイテム
		SCORE_ITEM_ANI_LETTER,	// 1000		// 手紙のアイテム
		SCORE_ITEM_ANI_MEDAL,	// 1500		// 宝石のアイテム
		SCORE_ITEM_ANI_JEWELRY,	// 5000		// メダルのアイテム
		SCORE_ITEM_ANI_MONKEY,	// 50000	// サルのアイテム

		SCORE_DAMAGE_BULLET,	// 100		// 敵に弾を当てた時
		SCORE_DAMAGE_ATTACK,	// 500		// 敵に近接攻撃を当てたとき
		SCORE_RESCUE_PRISONER,	// 500		// 捕虜を助けた時
		SCORE_BONUS,			// 10000	// リザルトでのボーナス 自分の残機
		SCORE_KILLED_BOSS,		// 100000	// リザルトでのボーナス ボスを倒した時
		SCORE_TYPE_MAX,
	};

	CScoreManager();						// コンストラクタ
	~CScoreManager();						// デストラクタ

	/* メンバ関数 */
	HRESULT					Init(void);		// 初期化
	void					Uninit(void);	// 終了
	void					Update(void);	// 更新

	static					int				GetScorePoint(SCORE_TYPE type)				{ return m_nScore[type]; };

	/* 静的メンバ関数 */
	static					void			ScoreLoad();					// スコアのロード

	/* メンバ関数 */

private:
	/* 静的メンバ変数 */
	static	int					m_nScore[SCORE_TYPE_MAX];
	static	SCORE_DATA			m_ScoreData;									// スコアのデータ
	static	char				*m_ScoreFileName;								// スコアのファイル名
	static	void				SetScoreData();									// アイテムのデータ設定

	/* メンバ関数 */
};
#endif