// =====================================================================================================================================================================
//
// skydroneのAIの処理 [skydroneAI.h]
// Author : FujiwaraMasato
//
// =====================================================================================================================================================================
#ifndef _SKYDRONEAI_H_
#define _SKYDRONEAI_H_

// =====================================================================================================================================================================
// インクルードファイル
// =====================================================================================================================================================================
#include "main.h"
#include "scene.h"
#include "BaseAI.h"

// =====================================================================================================================================================================
// 前方宣言
// =====================================================================================================================================================================
class CWeakEnemy;
class CGun;
class CCollision;

// =====================================================================================================================================================================
// AIクラス
// =====================================================================================================================================================================
class CSkyDroneAI : public CBaseAI
{
public:
	// ドローンのAIの状態
	enum class DRONEAI_STATE
	{
		NONE = 0,			// 何もしない
		APPEARANCE,			// 登場
		STOP,				// 止まる
		MOVEROT,			// 回転
		LEAVE,				// 退場
		WALK_LEFT,			// 左移動
		WALK_RIGHT,			// 右移動
		AI_MAX				// 行動の最大数
	};

	// ドローンの移動
	enum class DRONEAI_LEAVESTATE
	{
		FIRST = 0,			//
		END,				//
	};

	CSkyDroneAI();											// コンストラクタ
	~CSkyDroneAI();											// デストラクタ

	/* メンバ関数 */
	HRESULT					Init(void);						// 初期化
	void					Uninit(void);					// 終了
	void					Update(void);					// 更新
	void					Draw(void);						// 描画
	void					DebugInfo(void);				// デバッグ情報表記

	/* 静的メンバ関数 */
	static CSkyDroneAI		*CreateAI(CWeakEnemy *pEnemy);	// AIの生成

	/* メンバ関数 */
	DRONEAI_STATE			GetAIType(void);				// AIの状態取得

private:
	/* メンバ関数 */
	void					SkyDroneAIState();				// ドローンのAIの状態

	/* メンバ変数 */
	CWeakEnemy				*m_pEnemyPass;					// 敵の情報の格納用
	DRONEAI_STATE			m_StateAI;						// 行動の種類
	DRONEAI_LEAVESTATE		m_LeaveState;
	int						m_nCntShotFrame;				// 撃つまでのカウント
	int						m_nCntMoveStopFrame;			// 止まるまでのカウント
	int						m_nRotCnt;						// 回転させるようカウント
	int						m_nWorkTime;					// ドローンの活動時間
	int						m_nAngle;
};
#endif