// =====================================================================================================================================================================
//
// ジィ・コッカのAIの処理 [zycoccaAI.h]
// Author : Sato Yoshiki
//
// =====================================================================================================================================================================
#ifndef _ZYCOCCAAI_H_
#define _ZYCOCCAAI_H_

// =====================================================================================================================================================================
// インクルードファイル
// =====================================================================================================================================================================
#include "main.h"
#include "scene.h"
#include "BaseAI.h"

// =====================================================================================================================================================================
// 前方宣言
// =====================================================================================================================================================================
class CWeakEnemy;
class CGun;
class CCollision;

// =====================================================================================================================================================================
// AIクラス
// =====================================================================================================================================================================
class CZycoccaAI : public CBaseAI
{
public:
	// ジィ・コッカのAIの状態
	enum class ZycoccaAI_STATE
	{
		NONE = 0,			//何もしない
		STOP,				//止まる
		WALK_LEFT,			//左移動
		WALK_RIGHT,			//右移動
		ATTACK,				//攻撃
		AI_MAX				//行動の最大数
	};

	CZycoccaAI();											// コンストラクタ
	~CZycoccaAI();											// デストラクタ

	/* メンバ関数 */
	HRESULT					Init(void);						// 初期化
	void					Uninit(void);					// 終了
	void					Update(void);					// 更新
	void					Draw(void);						// 描画
	void					DebugInfo(void);				// デバッグ情報表記

	/* 静的メンバ関数 */
	static CZycoccaAI		*CreateAI(CWeakEnemy *pEnemy);	// AIの生成

	/* メンバ関数 */
	ZycoccaAI_STATE			GetAIType(void);				// AIの状態取得

private:
	/* メンバ関数 */
	void					ZycoccaAIState();				// ジィ・コッカのAIの状態

	/* メンバ変数 */
	CWeakEnemy				*m_pEnemyPass;					// 敵の情報の格納用
	ZycoccaAI_STATE			m_StateAI;						// 行動の種類
	int						m_nCntShotFrame;				// 撃つまでのカウント
	int						m_nCntMoveStopFrame;			// 止まるまでのカウント
};
#endif