//------------------------------------------------------------------------------
//
//モデルの描画をするシェーダ
//Author:Yoshiki Hosoya
//
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
//インクルード
//------------------------------------------------------------------------------
#include "ShaderFanction.h"

//------------------------------------------------------------------------------
//ピクセルシェーダ
//------------------------------------------------------------------------------
// float4 mainPS(PSInput input) : COLOR0
// {
// 	//テクスチャの色　ライティングの分も含める
// 	 // input.OutputColor = GetModelMaterialColor();

// 	// return GetModelMaterialColor();

// 	// return float4(1,0,0,1);

// 	// return input.OutputColor;

// 	// return g_DiffuseColor;
// }


// ピクセルシェーダ
float4 NoWorkingPixelShader( float4 ScreenColor : COLOR0 ) : COLOR
{
   // 入力されたスクリーンピクセルの色をそのままスルー
   return ScreenColor;
}

//------------------------------------------------------------------------------
//テクニック
//------------------------------------------------------------------------------
technique technique0
{
	//パス0
	pass p0
	{
		//カリングモード
		CullMode = CCW;

		//頂点シェーダ
		VertexShader = compile vs_3_0 BaseVertexShader();

		//ピクセルシェーダ
		PixelShader = compile ps_3_0 NoWorkingPixelShader();
	}
}