// ------------------------------------------
//
// アビリティ―ヘッダー処理 [ability.h]
// Author : Fujiwara Masato
//
// ------------------------------------------
#ifndef _ABILITY_H_
#define _ABILITY_H_

#define _CRT_SECURE_NO_WARNINGS

// ------------------------------------------
//
// インクルードファイル
//
// ------------------------------------------
#include "main.h"

// ------------------------------------------
//
// マクロ定義
//
// ------------------------------------------

// ------------------------------------------
//
// 前方宣言
//
// ------------------------------------------

// ------------------------------------------
//
// クラス
//
// ------------------------------------------
class CAbility
{
public:
	/* 関数 */
	CAbility();
	~CAbility();
	void Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
protected:
private:
};
#endif
