//------------------------------------------------------------------------------
//
//デバッグ　エフェクトビューワ用の処理  [Debug_EffectViewer.cpp]
//Author:Yoshiki Hosoya
//
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
//インクルード
//------------------------------------------------------------------------------
#include "Debug_ModelViewer.h"
#include "Debug_ViewerCharacter.h"
#include "../../Scene.h"
#include "../../manager.h"
#include "../../renderer.h"
#include "../../inputKeyboard.h"
#include "../../camera.h"
#include "../../fade.h"
//------------------------------------------------------------------------------
//静的メンバ変数の初期化
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
//マクロ
//------------------------------------------------------------------------------
#define DEFAULT_PLAYER_POS (ZeroVector3)
#define DEFAULT_SCORE_POS (D3DXVECTOR3(1150.0f, 50.0f, 0.0f))

//------------------------------------------------------------------------------
//コンストラクタ
//------------------------------------------------------------------------------
CDebug_ModelViewer::CDebug_ModelViewer()
{
	//ビューワ用のキャラクター作成
	m_pViewerCharacter = CDebug_ViewerCharacter::Create();
}
//------------------------------------------------------------------------------
//デストラクタ
//------------------------------------------------------------------------------
CDebug_ModelViewer::~CDebug_ModelViewer()
{

}

//------------------------------------------------------------------------------
//初期化処理
//------------------------------------------------------------------------------
HRESULT CDebug_ModelViewer::Init(HWND hWnd)
{
	return S_OK;
}

//------------------------------------------------------------------------------
//終了処理
//------------------------------------------------------------------------------
void CDebug_ModelViewer::Uninit()
{

	//終了処理
	CScene::RereaseAll();
}

//------------------------------------------------------------------------------
//更新処理
//------------------------------------------------------------------------------
void CDebug_ModelViewer::Update()
{

}

//------------------------------------------------------------------------------
//描画処理
//------------------------------------------------------------------------------
void CDebug_ModelViewer::Draw()
{

}
//------------------------------------------------------------------------------
//デバッグ情報表記
//------------------------------------------------------------------------------
void CDebug_ModelViewer::ShowDebugInfo()
{
#ifdef _DEBUG

	//キャラクター情報情報
	if (ImGui::Begin("MotionViewer"))
	{
		//Tab
		if (ImGui::BeginTabBar("Viewer", m_bModel))
		{
			//Tab
			if (ImGui::BeginTabItem("MotionViewer"))
			{
				//モーションビューワ
				m_pViewerCharacter->MotionViewer();
				ImGui::EndTabItem();
			}
			//Tab
			if (ImGui::BeginTabItem("OffsetViewer"))
			{
				//オフセットビューワ
				m_pViewerCharacter->OffsetViewer();
				ImGui::EndTabItem();
			}
			//TabEnd
			ImGui::EndTabBar();
		}

		ImGui::End();

	}
#endif
}
