//------------------------------------------------------------------------------
//
//後ろの雷処理  [backthunder.h]
//Author:Yoshiki Hosoya
//
//------------------------------------------------------------------------------
#ifndef _BACKTHUNDER_H_
#define _BACKTHUNDER_H_
//------------------------------------------------------------------------------
//インクルード
//------------------------------------------------------------------------------
#include "main.h"
#include "scene.h"
//------------------------------------------------------------------------------
//クラス定義
//------------------------------------------------------------------------------
class CBackThunder : public CScene
{
public:
	CBackThunder();				//コンストラクタ
	~CBackThunder();			//デストラクタ

	HRESULT Init();				//初期化
	void Uninit();				//終了
	void Update();				//更新
	void Draw();				//描画
	void ShowDebugInfo();		//デバッグ情報表示
	static void Create();		//生成処理

private:
	int m_nCnt;					//カウンタ
	int m_nNextThunder;			//次の雷のタイミング
};

#endif