//------------------------------------------------------------------------------
//
//デモプレイ処理  [demoplay.h]
//Author:Yoshiki Hosoya
//
//------------------------------------------------------------------------------
#ifndef _DEMO_PLAY_H_
#define _DEMO_PLAY_H_
//------------------------------------------------------------------------------
//インクルード
//------------------------------------------------------------------------------
#include "main.h"
#include "basemode.h"
//------------------------------------------------------------------------------
//マクロ
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
//クラス定義
//------------------------------------------------------------------------------
//前方宣言
class CPlayer;

class CDemoPlay : public CBaseMode
{
public:
	CDemoPlay();
	~CDemoPlay();
	HRESULT Init(HWND hWnd);						//初期化
	void Uninit();									//終了
	void Update();									//更新
	void Draw();									//描画
	void ShowDebugInfo();							//デバッグ情報表記

	CPlayer *GetPlayer(); 							//プレイヤーのポインタ取得

private:
	std::shared_ptr<CPlayer> m_pPlayer;				//プレイヤーのポインタ
	int m_nCntTitleFade;							//タイトルにフェードするまでのカウント
	int m_nEnemyPopTime;							//敵出現カウント
	void EnemyRespawn();							//敵出現処理
};

#endif