//------------------------------------------------------------------------------
//
//爆発の痕跡処理  [traces.h]
//Author:Yoshiki Hosoya
//
//------------------------------------------------------------------------------
#ifndef _TRACES_H_
#define _TRACES_H_
//------------------------------------------------------------------------------
//インクルード
//------------------------------------------------------------------------------
#include "main.h"
#include "scene3D.h"
//------------------------------------------------------------------------------
//クラス定義
//------------------------------------------------------------------------------
class CTraces : public CScene3D
{
public:
	CTraces();
	~CTraces();

	HRESULT Init();													//初期化
	void Uninit();													//終了
	void Update();													//更新
	void Draw();													//描画
	void ShowDebugInfo();											//デバッグ情報表示
	static void Create(D3DXVECTOR3 pos , D3DXVECTOR3 size);			//生成処理

private:
	int m_nLife;		//ライフ
};

#endif